assembly/assembly.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Some win32 assembly codes between 2002-2003</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Some win32 assembly codes between 2002-2003</h1>
</header><p>
这是02-03年间学习汇编程序的一些资料，希望能对一些人有用。
汇编是一门低级语言，win32下的汇编则直面windows的操作机制。
</p>
<div id="outline-container-org24bcb1b" class="outline-2">
<h2 id="org24bcb1b">一些程序</h2>
<div class="outline-text-2" id="text-org24bcb1b">
<ul class="org-ul">
<li><a href="./works/CheckIntegrity.zip">CheckIntegrity</a> 提供了一个 名为CheckFileIntegrity的库函数， 可以在Assembly/C/C++环境中调用这个库函数来检查自身或其它文件是否被病毒及其它程序修改过，以便做出相应的处理措施，比如防止自身程序在带毒或被修改的情况下运行等。</li>
<li><a href="./works/netenum.zip">NetEnum v1.0</a> 枚举局域网资源的小工具，</li>
<li><a href="./works/asmcut.zip">汇编切割器</a> 增加了浮动按扭，修正了一个BUG。</li>
<li><a href="./works/CFButton.zip">FButton ClassV1.02</a> 实现浮动按纽（汇编语言下OOP编程例子）。</li>
<li><a href="./works/once-app.zip">Once-App Programme</a> 只运行一个实例的三种方法.</li>
<li><a href="./works/harddisk.zip">Hard disk protect utility</a> 网友kevin的作品，对硬盘进行密码保护 (网友作品，非工作室所有)。</li>
</ul>
</div>
</div>
<div id="outline-container-org9ebdfc0" class="outline-2">
<h2 id="org9ebdfc0">Iczelion教程打包下载</h2>
<div class="outline-text-2" id="text-org9ebdfc0">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="./resources/lion-tu-c.zip">lion-tu-c.zip</a></td>
<td class="org-left"><a href="./resources/lion-tu-c-sources.zip">lion-tu-c-sources.zip</a> <a href="./resources/odbc-tutorial.zip">odbc-tutorial.zip</a></td>
<td class="org-left"><a href="./resources/pe-tutorial.zip">pe-tutorial.zip</a></td>
<td class="org-left"><a href="./resources/vxd-tutorial.zip">vxd-tutorial.zip</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org46ab9ad" class="outline-2">
<h2 id="org46ab9ad">收集的一些汇编网址</h2>
<div class="outline-text-2" id="text-org46ab9ad">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="http://www.movsd.com/">Masm32 Offical Homepage</a></td>
<td class="org-left"><a href="http://win32assembly.online.fr/">Iczelion’s homepage</a></td>
<td class="org-left"><a href="http://www.wotsit.org/">http://www.wotsit.org/</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://ourworld.compuserve.com/homepages/ernies_world/a.htm">Masm32 COM programming</a></td>
<td class="org-left"><a href="http://webster.cs.ucr.edu/">The art of Assembly</a></td>
<td class="org-left"><a href="http://board.win32asmcommunity.net/">Win32ASM Community messageboard</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://www.madwizard.org/">Masm32 OOP programming</a></td>
<td class="org-left"><a href="http://www.grc.com/steve.htm">Small is Beautiful</a></td>
<td class="org-left"><a href="http://developer.intel.com/design/PentiumII/manuals/">Intel Developer Manuals</a></td>
</tr>

<tr>
<td class="org-left"><a href="http://win32assembly.online.fr/">http://win32assembly.online.fr/</a></td>
<td class="org-left"><a href="http://users.daex.ufsc.br/~iczelion/">http://users.daex.ufsc.br/~iczelion/</a></td>
<td class="org-left"><a href="http://spiff.tripnet.se/~Iczelion">http://spiff.tripnet.se/~Iczelion</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
